# Домашнее задание. Лучше если каждая задачка будет оформлена в виде одного файла .py
# 1) Дан список [1, 2, 3, 4, 5]. Вывести квадраты всех чисел из списка

a = int(input())
if 3 <= a <=5:
    print("Spring")
elif 6 <= a <= 8:
    print("Summer")
elif 9 <= a <= 11:
    print("Autumn")
else: print("Winter")
